In [1]:
import pandas as pd
import numpy as np
#1
url = 'https://github.com/mindcandyy/Homework_Codecamp3/raw/main/train.csv'
df = pd.read_csv(url)
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [2]:
#2
df1=df.head(10)
df2=df.tail(10)
df3=df.sample(10)
print(df1)
print(df2)
print(df3)

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1
7            8         0       3
8            9         1       3
9           10         1       2

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0
7                     Palsson, Master. Gosta Leonard    male   2.0      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S
7      1            349909  21.0750   NaN        S
8      2            347742  11.1333   NaN        S
9      0            237736  30.0708   NaN        C
     PassengerId  Survived  Pclass                                      Name  \
881          882         0       3                        Markun, Mr. Johann
882          883         0       3              Dahlberg, Miss. Gerda Ulrika
883          884         0       2             Banfield, Mr. Frederick James
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
881    male  33.0      0      0            349257   7.8958   NaN        S
882  female  22.0      0      0              7552  10.5167   NaN        S
883    male  28.0      0      0  C.A./SOTON 34068  10.5000   NaN        S
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
887  female  19.0      0      0            112053  30.0000   B42        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
889    male  26.0      0      0            111369  30.0000  C148        C
890    male  32.0      0      0            370376   7.7500   NaN        Q
     PassengerId  Survived  Pclass  \
817          818         0       2
416          417         1       2
371          372         0       3
560          561         0       3
199          200         0       2
547          548         1       2
223          224         0       3
477          478         0       3
699          700         0       3
101          102         0       3

                                                Name     Sex   Age  SibSp  \
817                               Mallet, Mr. Albert    male  31.0      1
416  Drew, Mrs. James Vivian (Lulu Thorne Christian)  female  34.0      1
371                        Wiklund, Mr. Jakob Alfred    male  18.0      1
560                         Morrow, Mr. Thomas Rowan    male   NaN      0
199           Yrois, Miss. Henriette ("Mrs Harbeck")  female  24.0      0
547                       Padro y Manent, Mr. Julian    male   NaN      0
223                             Nenkoff, Mr. Christo    male   NaN      0
477                        Braund, Mr. Lewis Richard    male  29.0      1
699         Humblen, Mr. Adolf Mathias Nicolai Olsen    male  42.0      0
101                 Petroff, Mr. Pastcho ("Pentcho")    male   NaN      0

     Parch           Ticket     Fare  Cabin Embarked
817      1  S.C./PARIS 2079  37.0042    NaN        C
416      1            28220  32.5000    NaN        S
371      0          3101267   6.4958    NaN        S
560      0           372622   7.7500    NaN        Q
199      0           248747  13.0000    NaN        S
547      0    SC/PARIS 2146  13.8625    NaN        C
223      0           349234   7.8958    NaN        S
477      0             3460   7.0458    NaN        S
699      0           348121   7.6500  F G63        S
101      0           349215   7.8958    NaN        S

In [3]:
#3
df4=df['Embarked'].dropna()
print(df4)

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 889, dtype: object

In [4]:
#4
avg=df['Age'].mean()
print(avg)
df5=df['Age'].fillna(value=avg,inplace=True)
print(df5)

29.69911764705882
None

In [5]:
#5
df6=df['Age'].fillna(value=0, inplace=True)
print(df6)

None

In [6]:
#6  ลบ row ที่ age เป็นค่าว่าง
df7=df['Age'].dropna()
print(df7)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [7]:
#7. หาจำนวนผู้หญิงต่อผู้ชายที่อยู่บนเรือ
count=df['Sex'].value_counts()
print(count)
female_to_male=314/577
print(female_to_male)

male      577
female    314
Name: Sex, dtype: int64
0.5441941074523396

In [8]:
#8 หาจำนวนผู้หญิงและผู้ชายที่รอดชีวิต
df8=df[df['Survived']==1]
df9=df8[df8['Sex']=='male']
count_m=df9['Sex'].value_counts()
print(count_m)
df10=df8[df8['Sex']=='female']
count_fm=df10['Sex'].value_counts()
print(count_fm)
print("จำนวนผู้ชายรอด:{},จำนวนผู้ชายรอด:{}".format(count_m,count_fm))

male    109
Name: Sex, dtype: int64
female    233
Name: Sex, dtype: int64
จำนวนผู้ชายรอด:male    109
Name: Sex, dtype: int64,จำนวนผู้ชายรอด:female    233
Name: Sex, dtype: int64

In [9]:
#9. หา % การรอดชีวิตของผู้หญิงและผู้ชาย
count_fm=df10['Sex'].value_counts()
total=df['Sex'].value_counts()
print(total)
per_fm=count_fm/314*100
per_m=count_m/577*100
print("%รอดผู้หญิง{} , %รอดผู้ชาย{}".format(per_fm,per_m))

male      577
female    314
Name: Sex, dtype: int64
%รอดผู้หญิงfemale    74.203822
Name: Sex, dtype: float64 , %รอดผู้ชายmale    18.890815
Name: Sex, dtype: float64

In [10]:
#10. แปลงคอลัมน์ female = 0 และ male = 1
df12= df[df['Sex']=='male']
df['Sex'].replace({'male':'1','female':'0'},inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",1,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",1,32.000000,0,0,370376,7.7500,NaN,Q

In [11]:
#11. หาคนที่อายุมากที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน
df.sort_values('Age')[::-1]
print(df.iloc[[603],[3,5,11]])

                          Name   Age Embarked
603  Torber, Mr. Ernst William  44.0        S

In [12]:
#12. หาคนที่อายุน้อยที่สุดพร้อมบอกชื่อ อายุ และลงท่าที่ไหน
df.sort_values('Age')
print(df.iloc[[803],[3,5,11]])

                                Name   Age Embarked
803  Thomas, Master. Assad Alexander  0.42        C

In [13]:
#13. หาคนที่จ่ายค่าโดยสารแพงที่สุดพร้อมบอกชื่อ อายุ และ รอดชีวิตไหม
df.sort_values('Fare')[::-1]
print(df.iloc[[679],[3,5,1]])

                                   Name   Age  Survived
679  Cardeza, Mr. Thomas Drake Martinez  36.0         1

In [14]:
#14. หาคนที่จ่ายค่าโดยสารถูกที่สุดพร้อมบอกชื่อ อายุ และรอดชีวิตไหม
df.sort_values('Fare')
print(df.iloc[[271],[3,5,1]])

                             Name   Age  Survived
271  Tornquist, Mr. William Henry  25.0         1

In [15]:
#15. สรุปว่ามีคนนั่งตั๋ว 1 2 3 กี่คน
countticket = df['Pclass'].value_counts()
print(countticket)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
#16 หาค่าเฉลี่ยของตั๋วโดยสารแบบที่นั่งชั้น 1 2 3
p = df.groupby(['Pclass']).describe()
print("ค่าเฉลี่ยตั๋วชั้นที่1: {}, ค่าเฉลี่ยตั๋วชั้นที่2: {}, ค่าเฉลี่ยตั๋วชั้นที่3: {}".format(84.154687,20.662183,13.675550))

ค่าเฉลี่ยตั๋วชั้นที่1: 84.154687, ค่าเฉลี่ยตั๋วชั้นที่2: 20.662183, ค่าเฉลี่ยตั๋วชั้นที่3: 13.67555

In [17]:
#17. มีผู้โดยสารกี่คนที่อายุเกิน 50 แล้วรอดชีวิต
age50 = df[(df['Age']>50) & (df['Survived']==1)].shape
print("22คน")

22คน

In [18]:
#18. แสดงผลข้อมูลทั้งหมดของที่นั่งชั้น 1 2 3 (describe)
desc = df.groupby(['Pclass']).describe()
print(desc)

       PassengerId                                                             \
             count        mean         std   min     25%    50%    75%    max
Pclass
1            216.0  461.597222  246.737616   2.0  270.75  472.0  670.5  890.0
2            184.0  445.956522  250.852161  10.0  234.50  435.5  668.0  887.0
3            491.0  439.154786  264.441453   1.0  200.00  432.0  666.5  891.0

       Survived            ... Parch        Fare                             \
          count      mean  ...   75%  max  count       mean        std  min
Pclass                     ...
1         216.0  0.629630  ...   0.0  4.0  216.0  84.154687  78.380373  0.0
2         184.0  0.472826  ...   1.0  3.0  184.0  20.662183  13.417399  0.0
3         491.0  0.242363  ...   0.0  6.0  491.0  13.675550  11.778142  0.0


             25%      50%   75%       max
Pclass
1       30.92395  60.2875  93.5  512.3292
2       13.00000  14.2500  26.0   73.5000
3        7.75000   8.0500  15.5   69.5500

[3 rows x 48 columns]

In [19]:
#19. แสดงผลตั๋วที่แพงที่สุดของที่นั่งแต่ละชั้น
desc[('Fare','max')]

Pclass
1    512.3292
2     73.5000
3     69.5500
Name: (Fare, max), dtype: float64

In [50]:
#20. แสดงเป็นกลุ่มช่วงอายุ 0-10, 20-30 …. (เพิ่มทีละ10) และหา
#ว่าแต่ละกลุ่มมีอัตราการรอดชีวิตเท่าไหร่

tabl1= df[(df['Age']>0)&(df['Age']<=10)]
tabl1_count = tabl1[tabl1['Survived']==1]
print(tabl1.shape)
print("age0-10 อัตราการรอด:{} %".format(tabl1_count['Survived'].value_counts()/64*100))

tabl2= df[(df['Age']>20)&(df['Age']<=30)]
tabl2_count = tabl2[tabl2['Survived']==1]
print(tabl2.shape)
print("age20-30 อัตราการรอด:{} %".format(tabl2_count['Survived'].value_counts()/407*100))

tabl3= df[(df['Age']>40)&(df['Age']<=50)]
tabl3_count = tabl3[tabl3['Survived']==1]
print(tabl3.shape)
print("age40-50 อัตราการรอด:{} %".format(tabl3_count['Survived'].value_counts()/86*100))

tabl4= df[(df['Age']>60)&(df['Age']<=70)]
tabl4_count = tabl4[tabl4['Survived']==1]
print(tabl4.shape)
print("age40-50 อัตราการรอด:{} %".format(tabl4_count['Survived'].value_counts()/17*100))

(64, 12)
age0-10 อัตราการรอด:1    59.375
Name: Survived, dtype: float64 %
(407, 12)
age20-30 อัตราการรอด:1    33.415233
Name: Survived, dtype: float64 %
(86, 12)
age40-50 อัตราการรอด:1    38.372093
Name: Survived, dtype: float64 %
(17, 12)
age40-50 อัตราการรอด:1    23.529412
Name: Survived, dtype: float64 %

In [52]:
#21. เรียงลำดับตามราคามากไปน้อย และน้อยไปมาก
fare=df['Fare']
df.sort_values('Fare')[::-1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",1,36.000000,0,1,PC 17755,512.3292,B51 B53 B55,C
258,259,1,1,"Ward, Miss. Anna",0,35.000000,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",1,35.000000,0,0,PC 17755,512.3292,B101,C
341,342,1,1,"Fortune, Miss. Alice Elizabeth",0,24.000000,3,2,19950,263.0000,C23 C25 C27,S
438,439,0,1,"Fortune, Mr. Mark",1,64.000000,1,4,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
277,278,0,2,"Parkes, Mr. Francis ""Frank""",1,29.699118,0,0,239853,0.0000,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",1,29.699118,0,0,112052,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",1,19.000000,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",1,49.000000,0,0,LINE,0.0000,NaN,S
271,272,1,3,"Tornquist, Mr. William Henry",1,25.000000,0,0,LINE,0.0000,NaN,S